{
    "stages": [
        {
            "id": 1,
            "name": "Analisar", 
            "description": "Identificar quem são os principais usuários de um produto e a natureza do problema. Nesta etapa o designer deve se aproximar dos usuários e observar suas atividades, na tentativa de entender interesses, motivações e necessidades. A compreensão adequada do problema é proveniente do conhecimento aprofundado sobre aquilo que as pessoas desejam realizar e os impedimentos existentes na experiência atual. "
        },
        {
            "id": 2,
            "name": "Projetar", 
            "description": "Nessa etapa são desenvolvidas propostas de soluções que contemplem os requisitos estabelecidos para o sistema. A criação da proposta utiliza o estudo dos usuários como embasamento durante seu desenvolvimento. É o momento de exercício da criatividade, e os principais fundamentos da etapa são a geração de muitas ideias, o respeito às ideias que surgem, evitando criticismo no início do processo, e o questionamento constante sobre a adequação das soluções."
        },
        {
            "id": 3,
            "name": "Avaliar", 
            "description": "Verificar se a solução proposta está alinhada com os requisitos estabelecidos anteriormente e se satisfaz às necessidades dos usuários em seus diferentes contextos de uso. É durante as avaliações que a aceitação do design e a qualidade de uso são verificados. Podem ser feitas avaliações por especialistas ou com usuários. No último caso, é necessário identificar pessoas que fazem parte do público-alvo da solução e reuni-las para testar uma ideia. A avaliação é seguida por ciclos de iteração, em que acontecem o refinamento das ideias e a melhoria contínua da solução."
        }
    ],
    "tools": [
        {
            "id": 1,
            "name": "Entrevista contextual",
            "type": "academia",
            "stage_id": 1
        },
        {
            "id": 2,
            "name": "Questionário",
            "type": "academia",
            "stage_id": 1
        },
        {
            "id": 3,
            "name": "Mapa da empatia",
            "type": "indústria",
            "stage_id": 1
        },
        {
            "id": 4,
            "name": "Análise de competidores",
            "type": "indústria",
            "stage_id": 1
        },
        {
            "id": 5,
            "name": "Jornada do usuário",
            "type": "indústria",
            "stage_id": 1
        },
        {
            "id": 6,
            "name": "Proposta de valor",
            "type": "indústria",
            "stage_id": 2
        },
        {
            "id": 7,
            "name": "Mapa de estórias do usuário",
            "type": "indústria",
            "stage_id": 2
        },
        {
            "id": 8,
            "name": "Esboço sequencial",
            "type": "academia",
            "stage_id": 2
        },
        {
            "id": 9,
            "name": "Oficina de cocriação",
            "type": "indústria",
            "stage_id": 2
        },
        {
            "id": 10,
            "name": "Prototipação",
            "type": "academia",
            "stage_id": 2
        },
        {
            "id": 11,
            "name": "Cartão de teste",
            "type": "indústria",
            "stage_id": 3
        },
        {
            "id": 12,
            "name": "Teste de usabilidade",
            "type": "academia",
            "stage_id": 3
        },
        {
            "id": 13,
            "name": "Avaliação Heurística",
            "type": "academia",
            "stage_id": 3
        },
        {
            "id": 14,
            "name": "Questionários validados",
            "type": "academia",
            "stage_id": 3
        },
        {
            "id": 15,
            "name": "Cartão de aprendizados",
            "type": "academia",
            "stage_id": 3
        }
    ]
}